app/Controllers/Admin.php

    public function index()
{
    $db = db_connect();

    $totalCourses  = (int) $db->table('courses')->countAllResults();
    $totalStudents = (int) $db->table('students')->countAllResults();
    $totalEnroll   = (int) $db->table('takes')->countAllResults();

    $latestCourses = $db->table('courses')->orderBy('course_id','desc')->limit(5)->get()->getResultArray();

    $latestStudents = $db->table('students s')
        ->select('s.student_id, s.entry_year, u.full_name')
        ->join('users u', 'u.user_id = s.user_id')
        ->orderBy('s.student_id','desc')
        ->limit(5)->get()->getResultArray();
---
SELECT COUNT(*) AS `numrows`
FROM `courses`
SELECT COUNT(*) AS `numrows`
FROM `students`
SELECT COUNT(*) AS `numrows`
FROM `takes`
SELECT *
FROM `courses`
ORDER BY `course_id` DESC
 LIMIT 5
SELECT `s`.`student_id`, `s`.`entry_year`, `u`.`full_name`
FROM `students` `s`
JOIN `users` `u` ON `u`.`user_id` = `s`.`user_id`
ORDER BY `s`.`student_id` DESC
 LIMIT 5