app/Controllers/Auth.php

SELECT *
FROM `users`
WHERE `username` = 'cloey'
 LIMIT 1
---
    public function attempt() {
        $username = trim($this->request->getPost('username') ?? '');
        $password = (string) $this->request->getPost('password');

        $user = (new UserModel())->where('username', $username)->first();