app/Controllers/CourseController.php

SELECT *
FROM `courses`
ORDER BY `course_id` DESC
---
    public function index()
    {
        $courses = (new CourseModel())->orderBy('course_id','desc')->findAll();

DELETE FROM `courses`
WHERE `course_id` IN ('5')
---
    public function delete($id)
    {
        (new CourseModel())->delete($id);