app/Controllers/StudentCourseController.php

SELECT *
FROM `students`
WHERE `user_id` = 6
 LIMIT 1
---
    private function currentNIM(): ?string
    {
        $userId = (int) session('user_id');
        if (!$userId) return null;
        $row = (new StudentModel())->where('user_id', $userId)->first();

SELECT `c`.`course_id`, `c`.`course_name`, `c`.`credits`, (CASE WHEN t.student_id IS NULL THEN 0 ELSE 1 END) AS enrolled
FROM `courses` `c`
LEFT JOIN `takes` `t` ON `t`.`course_id` = `c`.`course_id` AND `t`.`student_id` = '241112342'
ORDER BY `c`.`course_id` ASC
---
    public function index()
    {
        $nim = $this->currentNIM();
        if (!$nim) return redirect()->to('/login')->with('error','Data student tidak ditemukan.');

        $db = db_connect();
        $courses = $db->table('courses c')
            ->select("c.course_id, c.course_name, c.credits,
                      (CASE WHEN t.student_id IS NULL THEN 0 ELSE 1 END) AS enrolled")
            ->join('takes t', "t.course_id = c.course_id AND t.student_id = ".$db->escape($nim), 'left')
            ->orderBy('c.course_id','asc')
            ->get()->getResultArray();

SELECT *
FROM `takes`
WHERE `student_id` = '241112342'
AND `course_id` = 1
INSERT INTO `takes` (`student_id`, `course_id`, `enroll_date`) VALUES ('241112342', 1, '2025-09-16')
---
    public function enroll($courseId)
    {
        $nim = $this->currentNIM();
        if (!$nim) return redirect()->to('/login')->with('error','Data student tidak ditemukan.');

        $db = db_connect();

        // cek sudah ada belum
        $exists = $db->table('takes')
            ->where(['student_id' => $nim, 'course_id' => (int)$courseId])
            ->get()->getFirstRow();

        if ($exists) {
            return redirect()->to(site_url('student/courses'))->with('success','Sudah ter-enroll.');
        }

        // insert baru
        $db->table('takes')->insert([
            'student_id'  => $nim,
            'course_id'   => (int)$courseId,
            'enroll_date' => date('Y-m-d'),
        ]);

SELECT `c`.`course_id`, `c`.`course_name`, `c`.`credits`, `t`.`enroll_date`
FROM `takes` `t`
JOIN `courses` `c` ON `c`.`course_id` = `t`.`course_id`
WHERE `t`.`student_id` = '241112342'
ORDER BY `t`.`enroll_date` DESC
---
    public function myCourses()
    {
        $nim = $this->currentNIM();
        if (!$nim) return redirect()->to('/login')->with('error','Data student tidak ditemukan.');

        $db = db_connect();
        $rows = $db->table('takes t')
            ->select('c.course_id, c.course_name, c.credits, t.enroll_date')
            ->join('courses c', 'c.course_id = t.course_id')
            ->where('t.student_id', $nim)
            ->orderBy('t.enroll_date','desc')
            ->get()->getResultArray();

DELETE FROM `takes`
WHERE `student_id` = '241112342'
AND `course_id` = 2
---
    public function unenroll($courseId)
    {
        $nim = $this->currentNIM();
        if (!$nim) return redirect()->to('/login')->with('error','Data student tidak ditemukan.');

        db_connect()->table('takes')
            ->where(['student_id'=>$nim, 'course_id'=>(int)$courseId])
            ->delete();