app/Controllers/StudentAdminController.php

SELECT `s`.`student_id`, `s`.`entry_year`, `u`.`user_id`, `u`.`username`, `u`.`full_name`
FROM `students` `s`
JOIN `users` `u` ON `u`.`user_id` = `s`.`user_id`
ORDER BY `s`.`student_id` ASC
---
    public function index()
    {
        // join sederhana users<-students
        $db = db_connect();
        $rows = $db->table('students s')
            ->select('s.student_id, s.entry_year, u.user_id, u.username, u.full_name')
            ->join('users u', 'u.user_id = s.user_id')
            ->orderBy('s.student_id','asc')->get()->getResultArray();

SELECT *
FROM `students`
WHERE `students`.`student_id` = '245531123'
DELETE FROM `students`
WHERE `student_id` IN ('245531123')
DELETE FROM `users`
WHERE `user_id` IN ('8')
---
    public function delete($nim)
    {
        // hapus student + (opsional) user terkait
        $student = (new StudentModel())->find($nim);
        if ($student) {
            $db = db_connect();
            $db->transStart();
            try {
                // hapus student dulu
                (new StudentModel())->delete($nim);

                // opsional: hapus user (hati2 kalau suatu saat 1 user bisa punya lebih dari 1 peran)
                (new UserModel())->delete($student['user_id']);